### INTRO TO DATA WRANGLING WITH PANDAS AND NUMPY

In [1]:
import numpy as np
import pandas as pd

In [11]:
salary = [2,3,12.0,14,56,'segun']
type(salary)

# convert the list to a numpy array

salary_array = np.array(salary)

salary_array.dtype

dtype('<U32')

In [12]:
salary_array

array(['2', '3', '12.0', '14', '56', 'segun'], dtype='<U32')

In [13]:
students = [
    ['segun',23,'m'],
    ['tola',15,'f'],
    ['john',13,'f'],
    ['segun',23,'m'],
    ['tola',15,'f'],
    ['john',13,'f'],
]

students = np.array(students)
students

array([['segun', '23', 'm'],
       ['tola', '15', 'f'],
       ['john', '13', 'f'],
       ['segun', '23', 'm'],
       ['tola', '15', 'f'],
       ['john', '13', 'f']], dtype='<U11')

In [ ]:
# created from array
students_table = pd.DataFrame(data=students, columns=['name','age','gender'])
students_table

    name age gender
0  segun  23      m
1   tola  15      f
2   john  13      f
3  segun  23      m
4   tola  15      f
5   john  13      f

In [16]:
# create a dataframe from a dictionary

clubs = {
    'name': ['spurs','utd','chelshit','arsenal','barca'],
    'ucl': [0, 3, 2, 0, 5],
    'best_player': ['son','amad','palmer','odegaard','yamal']
}

clubs_df = pd.DataFrame(data = clubs)
clubs_df

       name  ucl best_player
0     spurs    0         son
1       utd    3        amad
2  chelshit    2      palmer
3   arsenal    0    odegaard
4     barca    5       yamal

In [17]:
music = [
    ['P-diddy', 'usa', 'm'],
    ['Burna', 'Nigeria', 'm'],
    ['Ayra', 'Nigeria', 'f'],
    ['Llona', 'Nigeria', 'm'],
    ['tope alabi','Benin', 'f']
]

music_df = pd.DataFrame(data = music, columns=['name','country','gender'])
music_df

         name  country gender
0     P-diddy      usa      m
1       Burna  Nigeria      m
2        Ayra  Nigeria      f
3       Llona  Nigeria      m
4  tope alabi    Benin      f